10/data/attachments/90e134aa570f935d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:username>
            <nif:friendToBeAdded>John_major_Friend_89531_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>